1. Identify the primary keys and foreign keys in maven movies db. Discuss the differences.

In [ ]:
SELECT * FROM information_schema.key_column_usage;

2. List all details of actors.

In [ ]:
SELECT *
FROM actor;

3. List all customer information from DB.

In [ ]:
SELECT *
FROM customer;

4. List different countries.

In [ ]:
SELECT DISTINCT country
FROM country;

5. Display all active customers.

In [ ]:
SELECT *
FROM customer
WHERE active = 1; -- The 'active' column is a BOOLEAN, where 1 typically means TRUE/Active.

6. List of all rental IDs for customer with ID 1.

In [ ]:
SELECT rental_id
FROM rental
WHERE customer_id = 1;

7. Display all the films whose rental duration is greater than 5.

In [ ]:
SELECT *
FROM film
WHERE rental_duration > 5;

8. List the total number of films whose replacement cost is greater than $15 and less than $20.

In [ ]:
SELECT COUNT(*)
FROM film
WHERE replacement_cost > 15 AND replacement_cost < 20;

9. Display the count of unique first names of actors.

In [ ]:
SELECT COUNT(DISTINCT first_name)
FROM actor;

10. Display the first 10 records from the customer table.

In [ ]:
SELECT *
FROM customer
LIMIT 10;

11. Display the first 3 records from the customer table whose first name starts with 'b'.

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'B%'
LIMIT 3;

12. Display the names of the first 5 movies which are rated as 'G'.

In [ ]:
SELECT title
FROM film
WHERE rating = 'G'
LIMIT 5;

13. Find all customers whose first name starts with "a".

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'A%';

14. Find all customers whose first name ends with "a".

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '%A';

15. Display the list of first 4 cities which start and end with "a".

In [ ]:
SELECT city
FROM city
WHERE city LIKE 'A%A'
LIMIT 4;

16. Find all customers whose first name have "Ni" in any position.

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '%NI%';

17. Find all customers whose first name have "r" in the second position.

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '_R%';

18. Find all customers whose first name starts with "a" and are at least 5 characters in length.

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'A____%'; -- 'A' followed by four underscore wildcards (_) represents 5 characters minimum.

19. Find all customers whose first name starts with "a" and ends with "o".

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'A%O';

20. Get the films with pg and pg-13 rating using IN operator.

In [ ]:
SELECT *
FROM film
WHERE rating IN ('PG', 'PG-13');

21. Get the films with length between 50 to 100 using between operator.

In [ ]:
SELECT *
FROM film
WHERE length BETWEEN 50 AND 100;

22. Get the top 50 actors using limit operator.

In [ ]:
SELECT *
FROM actor
LIMIT 50;

23. Get the distinct film ids from inventory table.

In [ ]:
SELECT DISTINCT film_id
FROM inventory;